distro-jbi/src/examples/HelloWorld2/message.soap

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
	<HelloRequest xmlns="urn:/HelloWorld2.wsdl">
        <text>hello</text>
    </HelloRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
